bezier_coanda_3d/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

def_pl          uniform 4.5e-3;

internalField   $def_pl;

boundaryField
{
    inOut
    {
        type            calculated;
        value           $internalField;
    }
    surface
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    coandaLower
    {
        type            calculated;
        value           $internalField;
    }

    coandaUpper
    {
        type            calculated;
        value           $internalField;
    }

    front
    {
        type            calculated;
        value           $internalField;
    }

    back
    {
        type            calculated;
        value           $internalField;
    }

}

// ************************************************************************* //
