bezier_coanda_3d/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inOut
    {
        type            patch;
        nFaces          19000;
        startFace       2883990;
    }
    coandaUpper
    {
        type            patch;
        nFaces          200;
        startFace       2902990;
    }
    coandaLower
    {
        type            patch;
        nFaces          200;
        startFace       2903190;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          19200;
        startFace       2903390;
    }
    back
    {
        type            patch;
        nFaces          9710;
        startFace       2922590;
    }
    front
    {
        type            patch;
        nFaces          9710;
        startFace       2932300;
    }
)

// ************************************************************************* //
