bezier_coanda_3d/system/faces
boundary
(
    inOut
    {
        type patch;
        faces
        (
            ( 8  0  1  9)
            ( 0  2  3  1)
            (14 10 11 15)
            ( 2 14 15  3)
            (10  8  9 11)
        );
    }

    coandaUpper
    {
        type patch;
        faces
        (
            (24 22 23 25)
        );
    }

    coandaLower
    {
        type patch;
        faces
        (
            (30 32 33 31)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 4 28 29  5)
            ( 4 36 37  5)
            (28 26 27 29)
            (26 24 25 27)
            (22 30 31 23)
            (32 34 35 33)
            (34 36 37 35)
        );
    }

    back
    {
        type patch;
        faces
        (
            ( 4 28  8  0)
            (28 26 10  8)
            (26 34 32 24)
            (24 32 30 22)
            (10 14 34 26)
            ( 0  2 36  4)
            ( 2 14 34 36)
        );
    }

    front
    {
        type patch;
        faces
        (
            ( 5 29  9  1)
            (29 27 11  9)
            (27 35 33 25)
            (25 33 31 23)
            (11 15 35 27)
            ( 1  3 37  5)
            ( 3 15 35 37)
        );
    }


);
